Revit 2024 API
RebarBendData.BarNominalDiameter Property
 Defines the nominal diameter of the bar.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public double BarNominalDiameter { get; set; }
Visual Basic
Public Property BarNominalDiameter As Double
	Get
	Set
Visual C++
public:
property double BarNominalDiameter {
	double get ();
	void set (double value);
}
See Also
RebarBendData Class
Autodesk.Revit.DB.Structure Namespace